Revit 2027 API
AnalysisDisplayStyle.SetVectorSettings Method
 Set vector settings object for the style.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetVectorSettings(
	AnalysisDisplayVectorSettings vectorSettings
)
Public Sub SetVectorSettings (
	vectorSettings As AnalysisDisplayVectorSettings
)
public:
void SetVectorSettings(
	AnalysisDisplayVectorSettings^ vectorSettings
)
member SetVectorSettings :
        vectorSettings : AnalysisDisplayVectorSettings -> unit
Parameters
vectorSettings AnalysisDisplayVectorSettings
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
InvalidOperationException |  Vector settings were not created with the object.
See Also
Reference
AnalysisDisplayStyle Class
Autodesk.Revit.DB.Analysis Namespace